tutorials/combustion/coldEngineFoam/freePiston/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             coldEngineFoam;

startFrom               startTime;

startTime               0;

stopAt                  endTime;

endTime                 0.03;

deltaT                  5.0e-7;

writeControl            adjustableRunTime;

writeInterval           0.001;

purgeWrite              0;

writeFormat             binary;

writePrecision          6;

writeCompression        off;

timeFormat              general;

timePrecision           8;

runTimeModifiable       true;

adjustTimeStep          yes;

maxCo                   0.25;

// ************************************************************************* //
